       IDENTIFICATION DIVISION.
       PROGRAM-ID. ADDNUMS.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM1 PIC 9(3).
       01 NUM2 PIC 9(3).
       01 RESULT PIC 9(4).
       01 RESULT-DISPLAY PIC X(4).

       PROCEDURE DIVISION.
           DISPlAY "ENTER NUM1: " WITH NO ADVANCING.
           ACCEPT NUM1.
           DISPLAY "ENTER NUM2: " WITH NO ADVANCING.
           ACCEPT NUM2.
           ADD NUM1 TO NUM2 GIVING RESULT.
           STRING RESULT INTO RESULT-DISPLAY.
           DISPLAY "THE RESULT IS: " RESULT.
           STOP RUN.
