       IDENTIFICATION DIVISION.
           PROGRAM-ID. READ-EMPLOYEE.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
           FILE-CONTROL.
           SELECT EMPLOYEE-FILE ASSIGN TO "employee.dat"
             ORGANIZATION IS LINE SEQUENTIAL
             ACCESS MODE IS SEQUENTIAL
             FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD EMPLOYEE-FILE.
       01 EMPLOYEE-RECORD-IN.
           02 EMP-NAME         PIC X(20).
           02 EMP-DEPARTMENT   PIC X(15).
           02 EMP-POSITION     PIC X(20).
           02 EMP-SALARY       PIC 9(7)V99.

       WORKING-STORAGE SECTION.
       01 FILE-STATUS  PIC 9(2).

       PROCEDURE DIVISION.

           OPEN INPUT EMPLOYEE-FILE.
           IF FILE-STATUS NOT = 0
               DISPLAY "Error opening file, status: " FILE-STATUS
               STOP RUN.

           PERFORM READ-AND-DISPLAY-EMPLOYEE 5 TIMES.
           CLOSE EMPLOYEE-FILE.
           STOP RUN.

       READ-AND-DISPLAY-EMPLOYEE.
           READ EMPLOYEE-FILE.
           DISPLAY EMP-NAME EMP-DEPARTMENT EMP-POSITION EMP-SALARY.
