       IDENTIFICATION DIVISION.
           PROGRAM-ID. HELLO.

       PROCEDURE DIVISION.
           DISPLAY "Hello, Business World!".
           STOP RUN.
