       IDENTIFICATION DIVISION.
           PROGRAM-ID. SCREEN-ENTRY.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 CUSTOMER-NAME PIC X(20).
       01 CUSTOMER-ID   PIC 9(5).

       SCREEN SECTION.
       01 CUSTOMER-FORM.
           02 BLANK SCREEN.
           02 LINE 1 COL 10 VALUE "Customer Entry Form".
           02 LINE 3 COL 5 VALUE "Customer ID: ".
           02 LINE 3 COL 20 PIC 9(5) USING CUSTOMER-ID.
           02 LINE 4 COL 5 VALUE "Customer Name: ".
           02 LINE 4 COL 20 PIC X(20) USING CUSTOMER-NAME.

       PROCEDURE DIVISION.
           DISPLAY CUSTOMER-FORM.
           ACCEPT CUSTOMER-FORM.
           DISPLAY "You entered: ".
           DISPLAY "Customer ID: " CUSTOMER-ID.
           DISPLAY "Customer Name: " CUSTOMER-NAME.

           STOP RUN.
